Repository: polettoespana/carttrigger-quantity-discounts
Catalog: languages/carttrigger-quantity-discounts-*.po
Languages: es_es, it_it

source: Discount for %d items
es_es: Descuento por %d productos
it_it: Sconto per %d prodotti

source: Settings saved.
es_es: Configuración guardada.
it_it: Impostazioni salvate.

source: Quantity Discounts
es_es: Descuentos por Cantidad
it_it: Sconti per Quantità

source: Each rule defines when to show the notice (trigger) and which discount to apply when the customer reaches the threshold (target). Selecting a parent category automatically includes its subcategories.
es_es: Cada regla define cuándo mostrar el aviso (disparador) y qué descuento aplicar cuando el usuario alcanza el umbral (objetivo). Al seleccionar una categoría padre se incluyen automáticamente las subcategorías.
it_it: Ogni regola definisce quando mostrare l'avviso (trigger) e quale sconto applicare quando l'utente raggiunge la soglia (target). Selezionando una categoria padre vengono incluse automaticamente le sottocategorie.

source: Discount rules
es_es: Reglas de descuento
it_it: Regole di sconto

source: How the discount scope works:
es_es: Cómo funciona el ámbito del descuento:
it_it: Come funziona l'ambito dello sconto:

source: "Entire cart" applies the percentage to the full cart subtotal. "Category only" applies it only to the subtotal of matching items — useful for targeted discounts. Fixed amounts are not affected by scope. When multiple rules share the same Target and Scope, only the highest discount is applied automatically.
es_es: "Todo el carrito" aplica el porcentaje sobre el subtotal completo del carrito. "Solo categoría" lo aplica únicamente sobre el subtotal de los artículos coincidentes — útil para descuentos específicos. Los importes fijos no se ven afectados por el ámbito. Si varias reglas comparten el mismo Objetivo y el mismo Ámbito, se aplica automáticamente el descuento más alto.
it_it: "Intero carrello" applica la percentuale sul totale di tutti i prodotti. "Solo categoria" la applica solo sul subtotale degli articoli corrispondenti — utile per sconti mirati. Gli importi fissi non sono influenzati dall'ambito. Se più regole condividono lo stesso Target e lo stesso Ambito, viene applicato automaticamente lo sconto più alto.

source: Tip: for rules with the same Target and Scope, use the same discount value so the {discount} variable shown in the notice always matches what is actually applied.
es_es: Consejo: para reglas con el mismo Objetivo y el mismo Ámbito, usa siempre el mismo valor de descuento, así la variable {discount} mostrada en el aviso corresponderá exactamente al descuento aplicado.
it_it: Consiglio: per regole con lo stesso Target e stesso Ambito usa sempre lo stesso valore di sconto, così la variabile {discount} mostrata nell'avviso corrisponderà esattamente a quello applicato.

source: Trigger (qty)
es_es: Disparador (cant.)

source: Target (qty)
es_es: Objetivo (cant.)

source: Discount type
es_es: Tipo de descuento
it_it: Tipo sconto

source: Value
es_es: Valor
it_it: Valore

source: show notice
es_es: mostrar aviso
it_it: mostra avviso

source: apply discount
es_es: aplicar descuento
it_it: applica sconto

source: Percentage
es_es: Porcentaje
it_it: Percentuale

source: Fixed
es_es: Fijo
it_it: Fisso

source: Entire cart
es_es: Todo el carrito
it_it: Intero carrello

source: Category only
es_es: Solo categoría
it_it: Solo categoria

source: discount scope
es_es: ámbito del descuento
it_it: ambito sconto

source: All products
es_es: Todos los productos
it_it: Tutti i prodotti

source: Ctrl+click for multiple categories. Subcategories are included automatically.
es_es: Ctrl+clic para varias categorías. Las subcategorías se incluyen automáticamente.
it_it: Ctrl+clic per più categorie. Le sottocategorie sono incluse automaticamente.

source: Remove
es_es: Eliminar
it_it: Rimuovi

source: Add rule
es_es: Añadir regla
it_it: Aggiungi regola

source: Warning: inconsistent discounts for the same Target.
es_es: Atención: descuentos incoherentes para el mismo Objetivo.
it_it: Attenzione: sconti incoerenti per lo stesso Target.

source: Two or more rules with the same Target value have different discount amounts. The highest discount will be applied automatically, but the {discount} variable in the notice will reflect the active trigger's value — which may not match the actual discount applied. Recommendation: use the same discount type and value for all rules sharing the same Target.
es_es: Dos o más reglas con el mismo valor Objetivo tienen descuentos diferentes. Se aplicará automáticamente el descuento más alto, pero la variable {discount} en el aviso mostrará el valor del disparador activo — que podría no coincidir con el descuento realmente aplicado. Recomendación: usa el mismo tipo y valor de descuento para todas las reglas con el mismo Objetivo.
it_it: Due o più regole con lo stesso valore Target hanno sconti diversi. Verrà applicato automaticamente lo sconto più alto, ma la variabile {discount} nell'avviso mostrerà il valore del trigger attivo — che potrebbe non corrispondere allo sconto realmente applicato. Consiglio: usa lo stesso tipo e valore di sconto per tutte le regole con lo stesso Target.

source: Notice text
es_es: Texto del aviso
it_it: Testo avviso

source: Translation plugin detected: this text is registered as a translatable string. Translate it from your plugin's interface (WPML → String Translation / Polylang → String Translations).
es_es: Plugin de traducción detectado: este texto está registrado como cadena traducible. Tradúcelo desde la interfaz de tu plugin (WPML → String Translation / Polylang → Traducciones de cadenas).
it_it: Plugin di traduzione rilevato: questo testo è registrato come stringa traducibile. Traducilo dall'interfaccia del tuo plugin (WPML → String Translation / Polylang → Traduzioni stringhe).

source: Available variables:
es_es: Variables disponibles:
it_it: Variabili disponibili:

source: = current qty
es_es: = cantidad actual
it_it: = qty attuale

source: = items still needed
es_es: = productos que faltan para el objetivo
it_it: = prodotti mancanti al target

source: = target qty
es_es: = cantidad objetivo
it_it: = qty target

source: = formatted discount (e.g. 10% or €5.00)
es_es: = descuento formateado (p.ej. 10% o 5,00 €)
it_it: = sconto formattato (es. 10% o 5,00 €)

source: Notice type
es_es: Tipo de notificación
it_it: Tipo notifica

source: Determines WooCommerce semantic behaviour (placement, aria attributes). Use the custom CSS class below to control the visual style.
es_es: Determina el comportamiento semántico de WooCommerce (posición, atributos aria). Para el estilo visual usa la clase CSS a continuación.
it_it: Determina il comportamento semantico WooCommerce (posizione, attributi aria). Per lo stile visivo usa la classe CSS qui sotto.

source: Info (blue)
es_es: Informativa (azul)
it_it: Informativa (blu)

source: Success (green)
es_es: Éxito (verde)
it_it: Successo (verde)

source: Warning (red)
es_es: Atención (rojo)
it_it: Attenzione (rosso)

source: Custom CSS class
es_es: Clase CSS personalizada
it_it: Classe CSS personalizzata

source: One or more space-separated classes. They are added to the notice container in the frontend so you can style it freely via CSS.
es_es: Una o más clases separadas por espacio. Se añaden al contenedor del aviso en el frontend, para que puedas estilizarlo libremente con CSS.
it_it: Una o più classi separate da spazio. Vengono aggiunte al container della notice nel frontend, così puoi stilizzarla liberamente via CSS.

source: Example CSS in your theme:
es_es: Ejemplo CSS en tu tema:
it_it: Esempio CSS nel tuo tema:

source: Notice position
es_es: Posición de avisos
it_it: Posizione avvisi

source: Where to show
es_es: Dónde mostrar
it_it: Dove mostrare

source: Cart / checkout only
es_es: Solo carrito / checkout
it_it: Solo carrello / checkout

source: Product page only
es_es: Solo página de producto
it_it: Solo pagina prodotto

source: Cart and product page
es_es: Carrito y página de producto
it_it: Carrello e pagina prodotto

source: Cart / checkout notice
es_es: Aviso carrito / checkout
it_it: Avviso carrello / checkout

source: Product page notice
es_es: Aviso página de producto
it_it: Avviso pagina prodotto

source: Product page notice text
es_es: Texto del aviso en página de producto
it_it: Testo avviso pagina prodotto

source: Leave empty to reuse the cart notice text. Available variables: {current} {missing} {target} {discount}.
es_es: Deja vacío para usar el mismo texto del aviso del carrito. Variables disponibles: {current} {missing} {target} {discount}.
it_it: Lascia vuoto per usare lo stesso testo dell'avviso carrello. Variabili disponibili: {current} {missing} {target} {discount}.

source: Note: {current} and {missing} are calculated from the current cart (0 if the cart is empty).
es_es: Nota: {current} y {missing} se calculan sobre el carrito actual (0 si el carrito está vacío).
it_it: Nota: {current} e {missing} sono calcolati sul carrello corrente (0 se il carrello è vuoto).

source: Product page CSS class
es_es: Clase CSS página de producto
it_it: Classe CSS pagina prodotto

source: One or more space-separated classes, added to the notice container on the product page.
es_es: Una o más clases separadas por espacio, añadidas al contenedor del aviso en la página de producto.
it_it: Una o più classi separate da spazio, aggiunte al container dell'avviso nella pagina prodotto.

source: Settings
es_es: Ajustes
it_it: Impostazioni

source: Save settings
es_es: Guardar configuración
it_it: Salva impostazioni

source: You must keep at least one rule.
es_es: Debes mantener al menos una regla.
it_it: Devi mantenere almeno una regola.

source: Category / SKU
es_es: Categoría / SKU
it_it: Categoria / SKU

source: SKU (e.g. SKU1, SKU2)
es_es: SKU (p.ej. SKU1, SKU2)
it_it: SKU (es. SKU1, SKU2)

source: Comma-separated SKUs. Takes priority over category when set.
es_es: SKU separados por coma. Si se rellena, tiene prioridad sobre la categoría.
it_it: SKU separati da virgola. Se valorizzato ha priorità sulla categoria.

source: Behaviour with other discounts
es_es: Comportamiento con otros descuentos
it_it: Comportamento con altri sconti

source: Discount and notices go together:
es_es: Descuento y avisos van juntos:
it_it: Sconto e avvisi vanno insieme:

source: The selected mode controls both the automatic discount and the visibility of promotional notices in the cart and on the product page. In Exclusive and Best modes, notices are hidden when a coupon is active — so customers are never shown a discount promise that will not be applied.
es_es: El modo seleccionado controla tanto la aplicación del descuento automático como la visibilidad de los avisos promocionales en el carrito y en la página de producto. En los modos Exclusivo y Solo el mejor, los avisos se ocultan cuando hay un cupón activo — así el cliente nunca recibe promesas de descuentos que no se aplicarán.
it_it: La modalità selezionata controlla sia l'applicazione dello sconto automatico sia la visibilità degli avvisi promozionali nel carrello e nella pagina prodotto. Nelle modalità Esclusivo e Solo il migliore, gli avvisi vengono nascosti quando è attivo un coupon — così il cliente non riceve promesse di sconti che non verranno applicati.

source: Conflict mode
es_es: Modo de conflicto
it_it: Modalità conflitto

source: Stack
es_es: Acumula
it_it: Accumula

source: The quantity discount is always applied and notices are always shown, regardless of any active coupons (default behaviour).
es_es: El descuento por cantidad se aplica siempre y los avisos se muestran con normalidad, independientemente de los cupones presentes en el carrito (comportamiento predeterminado).
it_it: Lo sconto per quantità si applica sempre e gli avvisi vengono mostrati regolarmente, indipendentemente dai coupon presenti nel carrello (comportamento predefinito).

source: Exclusive
es_es: Exclusivo
it_it: Esclusivo

source: If at least one coupon is active, the quantity discount is skipped and notices are hidden to avoid misleading the customer.
es_es: Si hay al menos un cupón activo, el descuento no se aplica y los avisos se ocultan para evitar comunicaciones engañosas al cliente.
it_it: Se è attivo almeno un coupon, lo sconto non viene applicato e gli avvisi vengono nascosti per evitare comunicazioni fuorvianti al cliente.

source: Best discount wins
es_es: Solo el mejor
it_it: Solo il migliore

source: The quantity discount is applied only if its amount exceeds the total coupon discount; otherwise coupons take precedence and notices are hidden.
es_es: El descuento se aplica solo si su importe supera el total de los cupones activos; de lo contrario, los cupones tienen prioridad y los avisos se ocultan.
it_it: Lo sconto si applica solo se il suo importo supera il totale dei coupon attivi; altrimenti i coupon hanno la precedenza e gli avvisi vengono nascosti.

source: Warning: custom notice templates detected.
es_es: Advertencia: plantillas de aviso personalizadas detectadas.
it_it: Attenzione: template notice personalizzati rilevati.

source: Your theme already overrides: %s. The plugin cannot automatically add support for the custom CSS class in these files.
es_es: Tu tema ya tiene un override para: %s. El plugin no puede añadir automáticamente soporte para la clase CSS personalizada en estos archivos.
it_it: Il tuo tema ha già un override per: %s. Il plugin non può aggiungere automaticamente il supporto alla classe CSS personalizzata in questi file.

source: To enable the custom CSS class in notices, add these two lines inside the foreach loop of the template:
es_es: Para habilitar la clase CSS personalizada en los avisos, añade estas dos líneas dentro del bucle foreach del template:
it_it: Per abilitare la classe CSS personalizzata negli avvisi, aggiungi queste due righe dentro il ciclo foreach del template:
